Practice DataFrame, Data  Selection,  Group-By, Series, Sorting, Searching, statistics. Practice Data analysis using Pandas. For this exercise, we are using Automobile Dataset.  This Automobile Dataset has a different characteristic of an auto such as body-style, wheel-base, engine-type, price, mileage, horsepower and many more

## 1: From given data set print first and last five rows

## 2: Clean data and update the CSV file

Replace all column values which contain ‘?’ with "NA"

## 3: Find the most expensive car company name

Print most expensive car’s company name and price.

## 4: Print All Toyota Cars details

## 5: Count total cars per company

## 6: Find each company’s Higesht price car

## 7: Find the average mileage of each car making company

## 8: Sort all cars by Price column

## 9: Concatenate two data frames using the following conditions

Create two data frames using the following two Dicts, Concatenate those two data frames and create a key for each data frame.

Expected output pasted below:

               Company   Price
Germany 0         Ford   23845
        1     Mercedes  171995
        2          BMV  135925
        3         Audi   71400
Japan   0       Toyota   29995
        1        Honda   23600
        2       Nissan   61500
        3  Mitsubishi    58900

## 10: Merge two data frames using the following condition

Create two data frames using the following two Dicts, Merge two data frames, and append the second data frame as a new column to the first data frame.

Two dataframes looks like below :

Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}

car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

Expected Output:

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160